[Timeout] BlockStatement
src/app.js:12:39
 const app = express();
 
 app.use(cors({
-  origin: function (origin, callback) {
-    if (!origin) return callback(null, true);
-    const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
-    if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
-    callback(null, false);
-  }
+  origin: function (origin, callback) {}
 }));
 app.use(express.json());

[Killed] ConditionalExpression
src/app.js:13:9
 
 app.use(cors({
   origin: function (origin, callback) {
-    if (!origin) return callback(null, true);
+    if (true) return callback(null, true);
     const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
     if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
killedBy: CORS does not include Access-Control-Allow-Origin for unknown origin
statusReason: Error: expect(received).toBeUndefined()

Received: "https://evil.com"

[Killed] BooleanLiteral
src/app.js:13:9
 
 app.use(cors({
   origin: function (origin, callback) {
-    if (!origin) return callback(null, true);
+    if (origin) return callback(null, true);
     const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
     if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
killedBy: CORS does not include Access-Control-Allow-Origin for unknown origin
statusReason: Error: expect(received).toBeUndefined()

Received: "https://evil.com"

[Killed] ConditionalExpression
src/app.js:14:22
 app.use(cors({
   origin: function (origin, callback) {
     if (!origin) return callback(null, true);
-    const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
+    const origins = (true).split(',').map(s => s.trim());
     if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
     callback(null, false);
killedBy: CORS & CSP default env vars (baris 14, 21) uses default CORS origin list when CORS_ORIGIN is not set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArrowFunction
src/app.js:14:111
 app.use(cors({
   origin: function (origin, callback) {
     if (!origin) return callback(null, true);
-    const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
+    const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(() => undefined);
     if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
     callback(null, false);
killedBy: CORS includes Access-Control-Allow-Origin for whitelisted origin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/app.js:15:98
   origin: function (origin, callback) {
     if (!origin) return callback(null, true);
     const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
-    if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
+    if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, false);
     callback(null, false);
   }
killedBy: CORS includes Access-Control-Allow-Origin for whitelisted origin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/app.js:15:9
   origin: function (origin, callback) {
     if (!origin) return callback(null, true);
     const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
-    if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
+    if (origins.indexOf(origin) === -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
     callback(null, false);
   }
killedBy: CORS includes Access-Control-Allow-Origin for whitelisted origin
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/app.js:16:20
     if (!origin) return callback(null, true);
     const origins = (process.env.CORS_ORIGIN || 'http://localhost:3000,http://localhost:5173').split(',').map(s => s.trim());
     if (origins.indexOf(origin) !== -1 || process.env.CORS_ORIGIN === '*') return callback(null, true);
-    callback(null, false);
+    callback(null, true);
   }
 }));
killedBy: CORS does not include Access-Control-Allow-Origin for unknown origin
statusReason: Error: expect(received).toBeUndefined()

Received: "https://evil.com"

[Killed] LogicalOperator
src/app.js:21:21
 }));
 app.use(express.json());
 
-const supabaseUrl = process.env.SUPABASE_URL || 'https://prxmtxqngcapzqttljpd.supabase.co';
+const supabaseUrl = process.env.SUPABASE_URL && 'https://prxmtxqngcapzqttljpd.supabase.co';
 const supabaseHost = supabaseUrl.replace(/https?:\/\//, '').split('/')[0];
 
killedBy: CORS & CSP default env vars (baris 14, 21) uses default Supabase URL when SUPABASE_URL is not set
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'replace')"

      70 | app.use(express.json());
    > 72 | const supabaseHost = supabaseUrl.replace(stryMutAct_9fa48("28") ? /https:\/\// : (stryCov_9fa48("28"), /https?:\/\//), stryMutAct_9fa48("29") ? "Stryker was here!" : (stryCov_9fa48("29"), '')).split(stryMutAct_9fa

[Survived] StringLiteral
src/app.js:21:49
 }));
 app.use(express.json());
 
-const supabaseUrl = process.env.SUPABASE_URL || 'https://prxmtxqngcapzqttljpd.supabase.co';
+const supabaseUrl = process.env.SUPABASE_URL || "";
 const supabaseHost = supabaseUrl.replace(/https?:\/\//, '').split('/')[0];
 

[Survived] StringLiteral
src/app.js:22:57
 app.use(express.json());
 
 const supabaseUrl = process.env.SUPABASE_URL || 'https://prxmtxqngcapzqttljpd.supabase.co';
-const supabaseHost = supabaseUrl.replace(/https?:\/\//, '').split('/')[0];
+const supabaseHost = supabaseUrl.replace(/https?:\/\//, "Stryker was here!").split('/')[0];
 
 app.use((req, res, next) => {

[Timeout] BlockStatement
src/app.js:24:29
 const supabaseUrl = process.env.SUPABASE_URL || 'https://prxmtxqngcapzqttljpd.supabase.co';
 const supabaseHost = supabaseUrl.replace(/https?:\/\//, '').split('/')[0];
 
-app.use((req, res, next) => {
-  const host = req.get('host');
-  const protocol = host?.includes('localhost') || host?.startsWith('127.0.0.1') ? 'http' : 'https';
-  const origin = `${protocol}://${host}`;
-  res.setHeader(
-    "Content-Security-Policy",
-    `default-src 'self' ${origin}; ` +
-    `script-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
-    `style-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
-    `font-src 'self' https://cdnjs.cloudflare.com ${origin}; ` +
-    `img-src 'self' data: https://${supabaseHost} ${origin}; ` +
-    `connect-src 'self' https://${supabaseHost} ${origin}; ` +
-    `worker-src 'self'; frame-src 'none';`
-  );
-  next();
-});
+app.use((req, res, next) => {});
 
 const rootPath = path.join(__dirname, '..', 'public');

[Killed] ConditionalExpression
src/app.js:26:20
 
 app.use((req, res, next) => {
   const host = req.get('host');
-  const protocol = host?.includes('localhost') || host?.startsWith('127.0.0.1') ? 'http' : 'https';
+  const protocol = false ? 'http' : 'https';
   const origin = `${protocol}://${host}`;
   res.setHeader(
killedBy: CSP protocol detection (baris 26) sets protocol to http when host contains localhost
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "http://localhost:3000"

[Killed] MethodExpression
src/app.js:26:51
 
 app.use((req, res, next) => {
   const host = req.get('host');
-  const protocol = host?.includes('localhost') || host?.startsWith('127.0.0.1') ? 'http' : 'https';
+  const protocol = host?.includes('localhost') || host?.endsWith('127.0.0.1') ? 'http' : 'https';
   const origin = `${protocol}://${host}`;
   res.setHeader(
killedBy: CSP protocol detection (baris 26) sets protocol to http when host is 127.0.0.1
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "http://127.0.0.1:3000"

[Killed] StringLiteral
src/app.js:27:18
 app.use((req, res, next) => {
   const host = req.get('host');
   const protocol = host?.includes('localhost') || host?.startsWith('127.0.0.1') ? 'http' : 'https';
-  const origin = `${protocol}://${host}`;
+  const origin = ``;
   res.setHeader(
     "Content-Security-Policy",
killedBy: CSP protocol detection (baris 26) sets protocol to http when host contains localhost
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "http://localhost:3000"

[Killed] StringLiteral
src/app.js:29:5
   const protocol = host?.includes('localhost') || host?.startsWith('127.0.0.1') ? 'http' : 'https';
   const origin = `${protocol}://${host}`;
   res.setHeader(
-    "Content-Security-Policy",
+    "",
     `default-src 'self' ${origin}; ` +
     `script-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
killedBy: GET / serves index.html
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
src/app.js:32:5
     "Content-Security-Policy",
     `default-src 'self' ${origin}; ` +
     `script-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
-    `style-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
+    `` +
     `font-src 'self' https://cdnjs.cloudflare.com ${origin}; ` +
     `img-src 'self' data: https://${supabaseHost} ${origin}; ` +

[Survived] StringLiteral
src/app.js:33:5
     `default-src 'self' ${origin}; ` +
     `script-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
     `style-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
-    `font-src 'self' https://cdnjs.cloudflare.com ${origin}; ` +
+    `` +
     `img-src 'self' data: https://${supabaseHost} ${origin}; ` +
     `connect-src 'self' https://${supabaseHost} ${origin}; ` +

[Survived] StringLiteral
src/app.js:35:5
     `style-src 'self' 'unsafe-inline' https://cdn.tailwindcss.com https://cdnjs.cloudflare.com ${origin}; ` +
     `font-src 'self' https://cdnjs.cloudflare.com ${origin}; ` +
     `img-src 'self' data: https://${supabaseHost} ${origin}; ` +
-    `connect-src 'self' https://${supabaseHost} ${origin}; ` +
+    `` +
     `worker-src 'self'; frame-src 'none';`
   );

[Survived] StringLiteral
src/app.js:36:5
     `font-src 'self' https://cdnjs.cloudflare.com ${origin}; ` +
     `img-src 'self' data: https://${supabaseHost} ${origin}; ` +
     `connect-src 'self' https://${supabaseHost} ${origin}; ` +
-    `worker-src 'self'; frame-src 'none';`
+    ``
   );
   next();

[Killed] BlockStatement
src/app.js:53:44
 
 // Diberi nama (bukan lagi anonymous) dan di-export supaya bisa dites
 // langsung sebagai unit function, tanpa harus dipicu lewat request HTTP asli.
-function errorHandler(err, req, res, next) {
-  console.error('❌ Unhandled error:', err.message);
-  if (err instanceof multer.MulterError) {
-    if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
-    return res.status(400).json({ success: false, error: err.message });
-  }
-  if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
-  res.status(500).json({ success: false, error: err.message || 'Internal server error' });
-}
+function errorHandler(err, req, res, next) {}
 app.use(errorHandler);
 
killedBy: errorHandler (global error middleware) handles MulterError with LIMIT_FILE_SIZE code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
src/app.js:55:7
 // langsung sebagai unit function, tanpa harus dipicu lewat request HTTP asli.
 function errorHandler(err, req, res, next) {
   console.error('❌ Unhandled error:', err.message);
-  if (err instanceof multer.MulterError) {
+  if (false) {
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
killedBy: Error handler handles multer LIMIT_FILE_SIZE error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/app.js:55:7
 // langsung sebagai unit function, tanpa harus dipicu lewat request HTTP asli.
 function errorHandler(err, req, res, next) {
   console.error('❌ Unhandled error:', err.message);
-  if (err instanceof multer.MulterError) {
+  if (true) {
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
killedBy: errorHandler (global error middleware) handles custom "Hanya file PDF" error message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Hanya file PDF yang diperbolehkan",
+   "error": "Hanya file PDF",

[Killed] ConditionalExpression
src/app.js:56:9
 function errorHandler(err, req, res, next) {
   console.error('❌ Unhandled error:', err.message);
   if (err instanceof multer.MulterError) {
-    if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
+    if (false) return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
   }
killedBy: Error handler handles multer LIMIT_FILE_SIZE error
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "error"

Expected value: "Ukuran file maksimal 10 MB"
Received value: "File too large"

[Killed] ConditionalExpression
src/app.js:56:9
 function errorHandler(err, req, res, next) {
   console.error('❌ Unhandled error:', err.message);
   if (err instanceof multer.MulterError) {
-    if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
+    if (true) return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
   }
killedBy: errorHandler (global error middleware) handles other MulterError codes (fallback branch, baris 57)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Unexpected field",
+   "error": "Ukuran file maksimal 10 MB",

[Killed] BooleanLiteral
src/app.js:57:44
   console.error('❌ Unhandled error:', err.message);
   if (err instanceof multer.MulterError) {
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
-    return res.status(400).json({ success: false, error: err.message });
+    return res.status(400).json({ success: true, error: err.message });
   }
   if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
killedBy: errorHandler (global error middleware) handles other MulterError codes (fallback branch, baris 57)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Unexpected field",
-   "success": false,

[Killed] ObjectLiteral
src/app.js:57:33
   console.error('❌ Unhandled error:', err.message);
   if (err instanceof multer.MulterError) {
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
-    return res.status(400).json({ success: false, error: err.message });
+    return res.status(400).json({});
   }
   if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
killedBy: errorHandler (global error middleware) handles other MulterError codes (fallback branch, baris 57)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": "Unexpected field",
-   "success": false,

[Killed] BooleanLiteral
src/app.js:59:80
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
   }
-  if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
+  if (err.message === 'Hanya file PDF') return res.status(400).json({ success: true, error: 'Hanya file PDF yang diperbolehkan' });
   res.status(500).json({ success: false, error: err.message || 'Internal server error' });
 }
killedBy: errorHandler (global error middleware) handles custom "Hanya file PDF" error message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Hanya file PDF yang diperbolehkan",
-   "success": false,

[Killed] ConditionalExpression
src/app.js:59:7
     if (err.code === 'LIMIT_FILE_SIZE') return res.status(400).json({ success: false, error: 'Ukuran file maksimal 10 MB' });
     return res.status(400).json({ success: false, error: err.message });
   }
-  if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
+  if (true) return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
   res.status(500).json({ success: false, error: err.message || 'Internal server error' });
 }
killedBy: errorHandler (global error middleware) falls back to 500 for unexpected/generic errors (baris 60)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
src/app.js:60:49
     return res.status(400).json({ success: false, error: err.message });
   }
   if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
-  res.status(500).json({ success: false, error: err.message || 'Internal server error' });
+  res.status(500).json({ success: false, error: false });
 }
 app.use(errorHandler);
killedBy: errorHandler (global error middleware) falls back to 500 for unexpected/generic errors (baris 60)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Something totally unexpected broke",
+   "error": false,

[Killed] BooleanLiteral
src/app.js:60:35
     return res.status(400).json({ success: false, error: err.message });
   }
   if (err.message === 'Hanya file PDF') return res.status(400).json({ success: false, error: 'Hanya file PDF yang diperbolehkan' });
-  res.status(500).json({ success: false, error: err.message || 'Internal server error' });
+  res.status(500).json({ success: true, error: err.message || 'Internal server error' });
 }
 app.use(errorHandler);
killedBy: errorHandler (global error middleware) falls back to 500 for unexpected/generic errors (baris 60)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "error": "Something totally unexpected broke",
-   "success": false,

[Killed] BlockStatement
src/app.js:64:29
 }
 app.use(errorHandler);
 
-async function cekKoneksi() {
-  try {
-    const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
-    if (error) throw error;
-    console.log('✅ Koneksi Supabase berhasil');
-  } catch (err) {
-    const msg = (err.message || '').toLowerCase();
-    if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
-      console.log('⚠️ Tabel pralokmin_files belum ada');
-    } else {
-      console.error('❌ Gagal koneksi ke Supabase:', err.message);
-    }
-  }
-}
+async function cekKoneksi() {}
 cekKoneksi();
 
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs success when connection is fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "✅ Koneksi Supabase berhasil"

Number of calls: 0

[Killed] BlockStatement
src/app.js:65:7
 app.use(errorHandler);
 
 async function cekKoneksi() {
-  try {
-    const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
-    if (error) throw error;
-    console.log('✅ Koneksi Supabase berhasil');
-  } catch (err) {
+  try {} catch (err) {
     const msg = (err.message || '').toLowerCase();
     if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs success when connection is fine
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "✅ Koneksi Supabase berhasil"

Number of calls: 0

[Survived] StringLiteral
src/app.js:66:74
 
 async function cekKoneksi() {
   try {
-    const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
+    const { error } = await supabaseAdmin.from('pralokmin_files').select("").limit(1);
     if (error) throw error;
     console.log('✅ Koneksi Supabase berhasil');

[Killed] ConditionalExpression
src/app.js:67:9
 async function cekKoneksi() {
   try {
     const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
-    if (error) throw error;
+    if (false) throw error;
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"
Received: "✅ Koneksi Supabase berhasil"

Number of calls: 1

[Killed] ConditionalExpression
src/app.js:67:9
 async function cekKoneksi() {
   try {
     const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
-    if (error) throw error;
+    if (true) throw error;
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
killedBy: POST /api/upload returns 400 when bulan and klaster are missing
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/app.js:69:17
     const { error } = await supabaseAdmin.from('pralokmin_files').select('*').limit(1);
     if (error) throw error;
     console.log('✅ Koneksi Supabase berhasil');
-  } catch (err) {
-    const msg = (err.message || '').toLowerCase();
-    if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
-      console.log('⚠️ Tabel pralokmin_files belum ada');
-    } else {
-      console.error('❌ Gagal koneksi ke Supabase:', err.message);
-    }
-  }
+  } catch (err) {}
 }
 cekKoneksi();
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"

Number of calls: 0

[Killed] ConditionalExpression
src/app.js:70:18
     if (error) throw error;
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
-    const msg = (err.message || '').toLowerCase();
+    const msg = (true).toLowerCase();
     if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
       console.log('⚠️ Tabel pralokmin_files belum ada');
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] MethodExpression
src/app.js:70:17
     if (error) throw error;
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
-    const msg = (err.message || '').toLowerCase();
+    const msg = (err.message || '').toUpperCase();
     if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
       console.log('⚠️ Tabel pralokmin_files belum ada');
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"

Number of calls: 0

[Killed] LogicalOperator
src/app.js:71:9
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
     const msg = (err.message || '').toLowerCase();
-    if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
+    if ((msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation')) && msg.includes('not found') || msg.includes("doesn't exist")) {
       console.log('⚠️ Tabel pralokmin_files belum ada');
     } else {
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"

Number of calls: 0

[Killed] LogicalOperator
src/app.js:71:9
     console.log('✅ Koneksi Supabase berhasil');
   } catch (err) {
     const msg = (err.message || '').toLowerCase();
-    if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
+    if ((msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found')) && msg.includes("doesn't exist")) {
       console.log('⚠️ Tabel pralokmin_files belum ada');
     } else {
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"

Number of calls: 0

[Killed] StringLiteral
src/app.js:72:19
   } catch (err) {
     const msg = (err.message || '').toLowerCase();
     if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
-      console.log('⚠️ Tabel pralokmin_files belum ada');
+      console.log("");
     } else {
       console.error('❌ Gagal koneksi ke Supabase:', err.message);
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs warning when table does not exist yet
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "⚠️ Tabel pralokmin_files belum ada"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/app.js:73:12
     const msg = (err.message || '').toLowerCase();
     if (msg.includes('does not exist') || msg.includes('could not find the table') || msg.includes('relation') || msg.includes('not found') || msg.includes("doesn't exist")) {
       console.log('⚠️ Tabel pralokmin_files belum ada');
-    } else {
-      console.error('❌ Gagal koneksi ke Supabase:', err.message);
-    }
+    } else {}
   }
 }
killedBy: cekKoneksi (pengecekan koneksi Supabase saat startup) logs error for other connection failures
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "❌ Gagal koneksi ke Supabase:", "connection timeout"

Number of calls: 0
