[Killed] BlockStatement
src/routes/dashboard.js:6:37
 
 const router = Router();
 
-router.get('/', async (req, res) => {
-  try {
-    const result = [];
-    for (let n = 1; n <= 5; n++) {
-      const { data, error } = await supabase
-        .from('entries')
-        .select('status_capaian')
-        .eq('klaster', n);
-      if (error) throw error;
-      const total = data ? data.length : 0;
-      const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
-      result.push({
-        klaster: n,
-        total,
-        tercapai,
-        belum: total - tercapai,
-        persen: total ? Math.round((tercapai / total) * 100) : 0
-      });
-    }
-    res.json(result);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/', async (req, res) => {});
 
 module.exports = router;
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/dashboard.js:7:7
 const router = Router();
 
 router.get('/', async (req, res) => {
-  try {
-    const result = [];
-    for (let n = 1; n <= 5; n++) {
-      const { data, error } = await supabase
-        .from('entries')
-        .select('status_capaian')
-        .eq('klaster', n);
-      if (error) throw error;
-      const total = data ? data.length : 0;
-      const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
-      result.push({
-        klaster: n,
-        total,
-        tercapai,
-        belum: total - tercapai,
-        persen: total ? Math.round((tercapai / total) * 100) : 0
-      });
-    }
-    res.json(result);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/dashboard.js:9:21
 router.get('/', async (req, res) => {
   try {
     const result = [];
-    for (let n = 1; n <= 5; n++) {
+    for (let n = 1; false; n++) {
       const { data, error } = await supabase
         .from('entries')
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/routes/dashboard.js:9:21
 router.get('/', async (req, res) => {
   try {
     const result = [];
-    for (let n = 1; n <= 5; n++) {
+    for (let n = 1; n > 5; n++) {
       const { data, error } = await supabase
         .from('entries')
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 0
Received array:  []

[Survived] StringLiteral
src/routes/dashboard.js:11:15
     const result = [];
     for (let n = 1; n <= 5; n++) {
       const { data, error } = await supabase
-        .from('entries')
+        .from("")
         .select('status_capaian')
         .eq('klaster', n);

[Survived] StringLiteral
src/routes/dashboard.js:13:13
       const { data, error } = await supabase
         .from('entries')
         .select('status_capaian')
-        .eq('klaster', n);
+        .eq("", n);
       if (error) throw error;
       const total = data ? data.length : 0;

[Killed] ConditionalExpression
src/routes/dashboard.js:14:11
         .from('entries')
         .select('status_capaian')
         .eq('klaster', n);
-      if (error) throw error;
+      if (true) throw error;
       const total = data ? data.length : 0;
       const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/dashboard.js:14:11
         .from('entries')
         .select('status_capaian')
         .eq('klaster', n);
-      if (error) throw error;
+      if (false) throw error;
       const total = data ? data.length : 0;
       const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
killedBy: GET /api/dashboard returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ArrowFunction
src/routes/dashboard.js:16:43
         .eq('klaster', n);
       if (error) throw error;
       const total = data ? data.length : 0;
-      const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
+      const tercapai = data ? data.filter(() => undefined).length : 0;
       result.push({
         klaster: n,
killedBy: GET /api/dashboard calculates persen correctly for partial achievement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/routes/dashboard.js:16:48
         .eq('klaster', n);
       if (error) throw error;
       const total = data ? data.length : 0;
-      const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
+      const tercapai = data ? data.filter(d => d.status_capaian !== 'Mencapai Target').length : 0;
       result.push({
         klaster: n,
killedBy: GET /api/dashboard calculates persen correctly for partial achievement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] ObjectLiteral
src/routes/dashboard.js:17:19
       if (error) throw error;
       const total = data ? data.length : 0;
       const tercapai = data ? data.filter(d => d.status_capaian === 'Mencapai Target').length : 0;
-      result.push({
-        klaster: n,
-        total,
-        tercapai,
-        belum: total - tercapai,
-        persen: total ? Math.round((tercapai / total) * 100) : 0
-      });
+      result.push({});
     }
     res.json(result);
killedBy: GET /api/dashboard returns 5 clusters with total, tercapai, belum, persen
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "klaster"
Received path: []

Received value: {}

[Killed] ArithmeticOperator
src/routes/dashboard.js:21:16
         klaster: n,
         total,
         tercapai,
-        belum: total - tercapai,
+        belum: total + tercapai,
         persen: total ? Math.round((tercapai / total) * 100) : 0
       });
killedBy: GET /api/dashboard calculates persen correctly for partial achievement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] ArithmeticOperator
src/routes/dashboard.js:22:36
         total,
         tercapai,
         belum: total - tercapai,
-        persen: total ? Math.round((tercapai / total) * 100) : 0
+        persen: total ? Math.round(tercapai / total / 100) : 0
       });
     }
killedBy: GET /api/dashboard calculates persen correctly for partial achievement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 0

[Killed] ArithmeticOperator
src/routes/dashboard.js:22:37
         total,
         tercapai,
         belum: total - tercapai,
-        persen: total ? Math.round((tercapai / total) * 100) : 0
+        persen: total ? Math.round((tercapai * total) * 100) : 0
       });
     }
killedBy: GET /api/dashboard calculates persen correctly for partial achievement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 60
Received: 1500

[Killed] BlockStatement
src/routes/dashboard.js:26:17
       });
     }
     res.json(result);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/dashboard returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
