[Killed] BlockStatement
src/routes/entries.js:6:37
 
 const router = Router();
 
-router.get('/', async (req, res) => {
-  try {
-    let query = supabase.from('entries').select('*');
-    const klaster = req.query.klaster;
-    if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
-    const { data, error } = await query.order('created_at', { ascending: false });
-    if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
-    res.json(rows);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/', async (req, res) => {});
 
 router.post('/', async (req, res) => {
killedBy: GET /api/entries returns all entries without filter
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/entries.js:7:7
 const router = Router();
 
 router.get('/', async (req, res) => {
-  try {
-    let query = supabase.from('entries').select('*');
-    const klaster = req.query.klaster;
-    if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
-    const { data, error } = await query.order('created_at', { ascending: false });
-    if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
-    res.json(rows);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: GET /api/entries returns all entries without filter
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/routes/entries.js:10:9
   try {
     let query = supabase.from('entries').select('*');
     const klaster = req.query.klaster;
-    if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
+    if (false) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
     if (error) throw error;

[Survived] ConditionalExpression
src/routes/entries.js:10:9
   try {
     let query = supabase.from('entries').select('*');
     const klaster = req.query.klaster;
-    if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
+    if (true) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
     if (error) throw error;

[Survived] BooleanLiteral
src/routes/entries.js:11:74
     let query = supabase.from('entries').select('*');
     const klaster = req.query.klaster;
     if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
-    const { data, error } = await query.order('created_at', { ascending: false });
+    const { data, error } = await query.order('created_at', { ascending: true });
     if (error) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));

[Killed] ConditionalExpression
src/routes/entries.js:12:9
     const klaster = req.query.klaster;
     if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
-    if (error) throw error;
+    if (false) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
killedBy: Error handling returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/entries.js:12:9
     const klaster = req.query.klaster;
     if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
-    if (error) throw error;
+    if (true) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
killedBy: GET /api/entries returns all entries without filter
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
src/routes/entries.js:13:19
     if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
     if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
+    const rows = (data && []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
   } catch (err) {
killedBy: GET /api/entries returns all entries without filter
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/routes/entries.js:13:19
     if (klaster) query = query.or(`klaster.eq.${klaster},klaster.is.null`);
     const { data, error } = await query.order('created_at', { ascending: false });
     if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
+    const rows = (true).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
   } catch (err) {
killedBy: GET /api/entries returns all entries without filter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/routes/entries.js:15:17
     if (error) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: Error handling returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/routes/entries.js:22:21
 
 router.post('/', async (req, res) => {
   try {
-    const klaster = req.query.klaster || 5;
+    const klaster = true;
     const d = req.body;
     const { data, error } = await supabase

[Survived] ConditionalExpression
src/routes/entries.js:22:21
 
 router.post('/', async (req, res) => {
   try {
-    const klaster = req.query.klaster || 5;
+    const klaster = false;
     const d = req.body;
     const { data, error } = await supabase

[Survived] ObjectLiteral
src/routes/entries.js:26:15
     const d = req.body;
     const { data, error } = await supabase
       .from('entries')
-      .insert({
-        klaster: parseInt(klaster),
-        indikator_id: d.indikatorId,
-        petugas: d.petugas,
-        unit: d.unit || d.petugas,
-        bulan: d.bulan,
-        tahun: d.tahun,
-        periode: d.periode,
-        indikator_nama: d.indikatorNama,
-        target_tahunan: d.targetTahunan ?? '',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        target_bulanan: d.targetBulanan ?? 0,
-        aktual: d.aktual ?? '',
-        satuan: d.satuan || 'persen',
-        status_capaian: d.statusCapaian ?? '',
-        analisa: d.analisa ?? '',
-        rtl: d.rtl ?? '',
-        bor: d.bor ? true : false,
-        bor_hari_rawat: d.borHariRawat ?? 0,
-        bor_tt: d.borTT ?? 0,
-        bor_hari_periode: d.borHariPeriode ?? 0
-      })
+      .insert({})
       .select();
     if (error) throw error;

[Survived] ConditionalExpression
src/routes/entries.js:30:15
         klaster: parseInt(klaster),
         indikator_id: d.indikatorId,
         petugas: d.petugas,
-        unit: d.unit || d.petugas,
+        unit: false,
         bulan: d.bulan,
         tahun: d.tahun,

[Survived] ConditionalExpression
src/routes/entries.js:30:15
         klaster: parseInt(klaster),
         indikator_id: d.indikatorId,
         petugas: d.petugas,
-        unit: d.unit || d.petugas,
+        unit: true,
         bulan: d.bulan,
         tahun: d.tahun,

[Survived] LogicalOperator
src/routes/entries.js:35:25
         tahun: d.tahun,
         periode: d.periode,
         indikator_nama: d.indikatorNama,
-        target_tahunan: d.targetTahunan ?? '',
+        target_tahunan: d.targetTahunan && '',
         mode_bulanan: d.modeBulanan || 'bagi12',
         target_bulanan: d.targetBulanan ?? 0,

[Survived] ConditionalExpression
src/routes/entries.js:36:23
         periode: d.periode,
         indikator_nama: d.indikatorNama,
         target_tahunan: d.targetTahunan ?? '',
-        mode_bulanan: d.modeBulanan || 'bagi12',
+        mode_bulanan: true,
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',

[Survived] LogicalOperator
src/routes/entries.js:36:23
         periode: d.periode,
         indikator_nama: d.indikatorNama,
         target_tahunan: d.targetTahunan ?? '',
-        mode_bulanan: d.modeBulanan || 'bagi12',
+        mode_bulanan: d.modeBulanan && 'bagi12',
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',

[Survived] LogicalOperator
src/routes/entries.js:37:25
         indikator_nama: d.indikatorNama,
         target_tahunan: d.targetTahunan ?? '',
         mode_bulanan: d.modeBulanan || 'bagi12',
-        target_bulanan: d.targetBulanan ?? 0,
+        target_bulanan: d.targetBulanan && 0,
         aktual: d.aktual ?? '',
         satuan: d.satuan || 'persen',

[Survived] LogicalOperator
src/routes/entries.js:38:17
         target_tahunan: d.targetTahunan ?? '',
         mode_bulanan: d.modeBulanan || 'bagi12',
         target_bulanan: d.targetBulanan ?? 0,
-        aktual: d.aktual ?? '',
+        aktual: d.aktual && '',
         satuan: d.satuan || 'persen',
         status_capaian: d.statusCapaian ?? '',

[Survived] ConditionalExpression
src/routes/entries.js:39:17
         mode_bulanan: d.modeBulanan || 'bagi12',
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',
-        satuan: d.satuan || 'persen',
+        satuan: false,
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',

[Survived] ConditionalExpression
src/routes/entries.js:39:17
         mode_bulanan: d.modeBulanan || 'bagi12',
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',
-        satuan: d.satuan || 'persen',
+        satuan: true,
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',

[Survived] LogicalOperator
src/routes/entries.js:40:25
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',
         satuan: d.satuan || 'persen',
-        status_capaian: d.statusCapaian ?? '',
+        status_capaian: d.statusCapaian && '',
         analisa: d.analisa ?? '',
         rtl: d.rtl ?? '',

[Survived] StringLiteral
src/routes/entries.js:40:44
         target_bulanan: d.targetBulanan ?? 0,
         aktual: d.aktual ?? '',
         satuan: d.satuan || 'persen',
-        status_capaian: d.statusCapaian ?? '',
+        status_capaian: d.statusCapaian ?? "Stryker was here!",
         analisa: d.analisa ?? '',
         rtl: d.rtl ?? '',

[Survived] LogicalOperator
src/routes/entries.js:41:18
         aktual: d.aktual ?? '',
         satuan: d.satuan || 'persen',
         status_capaian: d.statusCapaian ?? '',
-        analisa: d.analisa ?? '',
+        analisa: d.analisa && '',
         rtl: d.rtl ?? '',
         bor: d.bor ? true : false,

[Survived] StringLiteral
src/routes/entries.js:41:31
         aktual: d.aktual ?? '',
         satuan: d.satuan || 'persen',
         status_capaian: d.statusCapaian ?? '',
-        analisa: d.analisa ?? '',
+        analisa: d.analisa ?? "Stryker was here!",
         rtl: d.rtl ?? '',
         bor: d.bor ? true : false,

[Survived] LogicalOperator
src/routes/entries.js:42:14
         satuan: d.satuan || 'persen',
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',
-        rtl: d.rtl ?? '',
+        rtl: d.rtl && '',
         bor: d.bor ? true : false,
         bor_hari_rawat: d.borHariRawat ?? 0,

[Survived] BooleanLiteral
src/routes/entries.js:43:29
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',
         rtl: d.rtl ?? '',
-        bor: d.bor ? true : false,
+        bor: d.bor ? true : true,
         bor_hari_rawat: d.borHariRawat ?? 0,
         bor_tt: d.borTT ?? 0,

[Survived] BooleanLiteral
src/routes/entries.js:43:22
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',
         rtl: d.rtl ?? '',
-        bor: d.bor ? true : false,
+        bor: d.bor ? false : false,
         bor_hari_rawat: d.borHariRawat ?? 0,
         bor_tt: d.borTT ?? 0,

[Survived] LogicalOperator
src/routes/entries.js:44:25
         analisa: d.analisa ?? '',
         rtl: d.rtl ?? '',
         bor: d.bor ? true : false,
-        bor_hari_rawat: d.borHariRawat ?? 0,
+        bor_hari_rawat: d.borHariRawat && 0,
         bor_tt: d.borTT ?? 0,
         bor_hari_periode: d.borHariPeriode ?? 0

[Survived] LogicalOperator
src/routes/entries.js:45:17
         rtl: d.rtl ?? '',
         bor: d.bor ? true : false,
         bor_hari_rawat: d.borHariRawat ?? 0,
-        bor_tt: d.borTT ?? 0,
+        bor_tt: d.borTT && 0,
         bor_hari_periode: d.borHariPeriode ?? 0
       })

[Survived] LogicalOperator
src/routes/entries.js:46:27
         bor: d.bor ? true : false,
         bor_hari_rawat: d.borHariRawat ?? 0,
         bor_tt: d.borTT ?? 0,
-        bor_hari_periode: d.borHariPeriode ?? 0
+        bor_hari_periode: d.borHariPeriode && 0
       })
       .select();

[Killed] ConditionalExpression
src/routes/entries.js:49:9
         bor_hari_periode: d.borHariPeriode ?? 0
       })
       .select();
-    if (error) throw error;
+    if (true) throw error;
     res.status(201).json({ id: data[0].id, message: 'Data berhasil disimpan.' });
   } catch (err) {
killedBy: POST /api/entries creates entry with valid data
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/routes/entries.js:49:9
         bor_hari_periode: d.borHariPeriode ?? 0
       })
       .select();
-    if (error) throw error;
+    if (false) throw error;
     res.status(201).json({ id: data[0].id, message: 'Data berhasil disimpan.' });
   } catch (err) {

[Killed] BlockStatement
src/routes/entries.js:51:17
       .select();
     if (error) throw error;
     res.status(201).json({ id: data[0].id, message: 'Data berhasil disimpan.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/entries returns 500 when insert fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/routes/entries.js:52:26
     if (error) throw error;
     res.status(201).json({ id: data[0].id, message: 'Data berhasil disimpan.' });
   } catch (err) {
-    res.status(500).json({ error: err.message });
+    res.status(500).json({});
   }
 });
killedBy: POST /api/entries returns 500 when insert fails
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "error"
Received path: []

Received value: {}

[Killed] StringLiteral
src/routes/entries.js:56:12
   }
 });
 
-router.put('/:id', async (req, res) => {
+router.put("", async (req, res) => {
   try {
     const d = req.body;
killedBy: PUT /api/entries/:id updates entry and sets updated_at
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] LogicalOperator
src/routes/entries.js:64:15
       .update({
         indikator_id: d.indikatorId,
         petugas: d.petugas,
-        unit: d.unit || d.petugas,
+        unit: d.unit && d.petugas,
         bulan: d.bulan,
         tahun: d.tahun,

[Survived] StringLiteral
src/routes/entries.js:76:23
         satuan: d.satuan || 'persen',
         status_capaian: d.statusCapaian ?? '',
         analisa: d.analisa ?? '',
-        rtl: d.rtl ?? '',
+        rtl: d.rtl ?? "Stryker was here!",
         bor: d.bor ? true : false,
         bor_hari_rawat: d.borHariRawat ?? 0,

[Survived] LogicalOperator
src/routes/entries.js:80:27
         bor: d.bor ? true : false,
         bor_hari_rawat: d.borHariRawat ?? 0,
         bor_tt: d.borTT ?? 0,
-        bor_hari_periode: d.borHariPeriode ?? 0,
+        bor_hari_periode: d.borHariPeriode && 0,
         updated_at: new Date().toISOString()
       })

[Survived] StringLiteral
src/routes/entries.js:83:11
         bor_hari_periode: d.borHariPeriode ?? 0,
         updated_at: new Date().toISOString()
       })
-      .eq('id', req.params.id);
+      .eq("", req.params.id);
     if (error) throw error;
     res.json({ message: 'Data diperbarui.' });

[Killed] ConditionalExpression
src/routes/entries.js:84:9
         updated_at: new Date().toISOString()
       })
       .eq('id', req.params.id);
-    if (error) throw error;
+    if (false) throw error;
     res.json({ message: 'Data diperbarui.' });
   } catch (err) {
killedBy: PUT /api/entries/:id returns 500 when update fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/entries.js:84:9
         updated_at: new Date().toISOString()
       })
       .eq('id', req.params.id);
-    if (error) throw error;
+    if (true) throw error;
     res.json({ message: 'Data diperbarui.' });
   } catch (err) {
killedBy: PUT /api/entries/:id updates entry and sets updated_at
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/routes/entries.js:85:14
       })
       .eq('id', req.params.id);
     if (error) throw error;
-    res.json({ message: 'Data diperbarui.' });
+    res.json({});
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: PUT /api/entries/:id updates entry and sets updated_at
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "message"
Received path: []

Received value: {}

[Killed] BlockStatement
src/routes/entries.js:86:17
       .eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Data diperbarui.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/entries/:id returns 500 when update fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/entries.js:91:43
   }
 });
 
-router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Data dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.delete('/:id', async (req, res) => {});
 
 module.exports = router;
killedBy: DELETE /api/entries/:id deletes entry
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
src/routes/entries.js:91:15
   }
 });
 
-router.delete('/:id', async (req, res) => {
+router.delete("", async (req, res) => {
   try {
     const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
killedBy: DELETE /api/entries/:id deletes entry
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/routes/entries.js:92:7
 });
 
 router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Data dihapus.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: DELETE /api/entries/:id deletes entry
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/entries.js:93:43
 
 router.delete('/:id', async (req, res) => {
   try {
-    const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
+    const { error } = await supabase.from("").delete().eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Data dihapus.' });

[Killed] ConditionalExpression
src/routes/entries.js:94:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (false) throw error;
     res.json({ message: 'Data dihapus.' });
   } catch (err) {
killedBy: DELETE /api/entries/:id returns 500 when delete fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/entries.js:94:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (true) throw error;
     res.json({ message: 'Data dihapus.' });
   } catch (err) {
killedBy: DELETE /api/entries/:id deletes entry
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/entries.js:96:17
     const { error } = await supabase.from('entries').delete().eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Data dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/entries/:id returns 500 when delete fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
