[Killed] BlockStatement
src/routes/files.js:7:50
 
 const router = Router();
 
-router.get('/status/:bulan', async (req, res) => {
-  try {
-    const { bulan } = req.params;
-    const { data, error } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('klaster, jenis')
-      .eq('bulan', bulan);
-    if (error) return res.status(500).json({ error: error.message });
-    const result = {};
-    for (let i = 1; i <= 5; i++) {
-      result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
-    }
-    data.forEach(row => { result[row.klaster][row.jenis] = true; });
-    res.json(result);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/status/:bulan', async (req, res) => {});
 
 router.get('/files/:bulan/:klaster', async (req, res) => {
killedBy: GET /api/status/:bulan returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/files.js:8:7
 const router = Router();
 
 router.get('/status/:bulan', async (req, res) => {
-  try {
-    const { bulan } = req.params;
-    const { data, error } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('klaster, jenis')
-      .eq('bulan', bulan);
-    if (error) return res.status(500).json({ error: error.message });
-    const result = {};
-    for (let i = 1; i <= 5; i++) {
-      result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
-    }
-    data.forEach(row => { result[row.klaster][row.jenis] = true; });
-    res.json(result);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: GET /api/status/:bulan returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/files.js:14:9
       .from('pralokmin_files')
       .select('klaster, jenis')
       .eq('bulan', bulan);
-    if (error) return res.status(500).json({ error: error.message });
+    if (true) return res.status(500).json({ error: error.message });
     const result = {};
     for (let i = 1; i <= 5; i++) {
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ConditionalExpression
src/routes/files.js:14:9
       .from('pralokmin_files')
       .select('klaster, jenis')
       .eq('bulan', bulan);
-    if (error) return res.status(500).json({ error: error.message });
+    if (false) return res.status(500).json({ error: error.message });
     const result = {};
     for (let i = 1; i <= 5; i++) {

[Killed] BlockStatement
src/routes/files.js:16:34
       .eq('bulan', bulan);
     if (error) return res.status(500).json({ error: error.message });
     const result = {};
-    for (let i = 1; i <= 5; i++) {
-      result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
-    }
+    for (let i = 1; i <= 5; i++) {}
     data.forEach(row => { result[row.klaster][row.jenis] = true; });
     res.json(result);
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
src/routes/files.js:16:21
       .eq('bulan', bulan);
     if (error) return res.status(500).json({ error: error.message });
     const result = {};
-    for (let i = 1; i <= 5; i++) {
+    for (let i = 1; i < 5; i++) {
       result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
     }
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 4
Received array:  ["1", "2", "3", "4"]

[Killed] BooleanLiteral
src/routes/files.js:17:31
     if (error) return res.status(500).json({ error: error.message });
     const result = {};
     for (let i = 1; i <= 5; i++) {
-      result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
+      result[i] = { undangan: true, notulen: false, daftar_hadir: false, lampiran: false };
     }
     data.forEach(row => { result[row.klaster][row.jenis] = true; });
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
src/routes/files.js:17:47
     if (error) return res.status(500).json({ error: error.message });
     const result = {};
     for (let i = 1; i <= 5; i++) {
-      result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
+      result[i] = { undangan: false, notulen: true, daftar_hadir: false, lampiran: false };
     }
     data.forEach(row => { result[row.klaster][row.jenis] = true; });

[Killed] BooleanLiteral
src/routes/files.js:19:60
     for (let i = 1; i <= 5; i++) {
       result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
     }
-    data.forEach(row => { result[row.klaster][row.jenis] = true; });
+    data.forEach(row => { result[row.klaster][row.jenis] = false; });
     res.json(result);
   } catch (err) {
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/routes/files.js:19:25
     for (let i = 1; i <= 5; i++) {
       result[i] = { undangan: false, notulen: false, daftar_hadir: false, lampiran: false };
     }
-    data.forEach(row => { result[row.klaster][row.jenis] = true; });
+    data.forEach(row => {});
     res.json(result);
   } catch (err) {
killedBy: GET /api/status/:bulan returns object with 5 clusters each having 4 boolean fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/routes/files.js:26:58
   }
 });
 
-router.get('/files/:bulan/:klaster', async (req, res) => {
-  try {
-    const { bulan, klaster } = req.params;
-    const { data, error } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('jenis, nama_file, storage_path, ukuran, diupload_pada')
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (error) throw error;
-    res.json(data);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/files/:bulan/:klaster', async (req, res) => {});
 
 router.delete('/file/:bulan/:klaster/:jenis', async (req, res) => {
killedBy: GET /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/files.js:27:7
 });
 
 router.get('/files/:bulan/:klaster', async (req, res) => {
-  try {
-    const { bulan, klaster } = req.params;
-    const { data, error } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('jenis, nama_file, storage_path, ukuran, diupload_pada')
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (error) throw error;
-    res.json(data);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: GET /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/files.js:34:9
       .select('jenis, nama_file, storage_path, ukuran, diupload_pada')
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (error) throw error;
+    if (false) throw error;
     res.json(data);
   } catch (err) {
killedBy: GET /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/files.js:34:9
       .select('jenis, nama_file, storage_path, ukuran, diupload_pada')
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (error) throw error;
+    if (true) throw error;
     res.json(data);
   } catch (err) {
killedBy: GET /api/files/:bulan/:klaster returns file metadata array
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/files.js:36:17
       .eq('klaster', parseInt(klaster));
     if (error) throw error;
     res.json(data);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
src/routes/files.js:41:15
   }
 });
 
-router.delete('/file/:bulan/:klaster/:jenis', async (req, res) => {
+router.delete("", async (req, res) => {
   try {
     const { bulan, klaster, jenis } = req.params;
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/routes/files.js:42:7
 });
 
 router.delete('/file/:bulan/:klaster/:jenis', async (req, res) => {
-  try {
-    const { bulan, klaster, jenis } = req.params;
-    const bucketName = 'pralokmin-files';
-    const { data, error: fetchError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('storage_path')
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster))
-      .eq('jenis', jenis)
-      .single();
-    if (fetchError) throw fetchError;
-    if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
-    await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
-    const { error: deleteDbError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .delete()
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster))
-      .eq('jenis', jenis);
-    if (deleteDbError) throw deleteDbError;
-    res.json({ success: true, message: 'File berhasil dihapus' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/files.js:47:15
     const bucketName = 'pralokmin-files';
     const { data, error: fetchError } = await supabaseAdmin
       .from('pralokmin_files')
-      .select('storage_path')
+      .select("")
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster))

[Killed] ConditionalExpression
src/routes/files.js:52:9
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis)
       .single();
-    if (fetchError) throw fetchError;
+    if (false) throw fetchError;
     if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
     await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
killedBy: DELETE /api/file/:bulan/:klaster/:jenis returns 404 when file does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] ConditionalExpression
src/routes/files.js:52:9
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis)
       .single();
-    if (fetchError) throw fetchError;
+    if (true) throw fetchError;
     if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
     await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/files.js:53:9
       .eq('jenis', jenis)
       .single();
     if (fetchError) throw fetchError;
-    if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
+    if (false) return res.status(404).json({ error: 'File tidak ditemukan' });
     await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
     const { error: deleteDbError } = await supabaseAdmin
killedBy: DELETE /api/file/:bulan/:klaster/:jenis returns 404 when single() returns null without fetchError (branch !data)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BooleanLiteral
src/routes/files.js:53:9
       .eq('jenis', jenis)
       .single();
     if (fetchError) throw fetchError;
-    if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
+    if (data) return res.status(404).json({ error: 'File tidak ditemukan' });
     await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
     const { error: deleteDbError } = await supabaseAdmin
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] StringLiteral
src/routes/files.js:56:13
     if (!data) return res.status(404).json({ error: 'File tidak ditemukan' });
     await supabaseAdmin.storage.from(bucketName).remove([data.storage_path]);
     const { error: deleteDbError } = await supabaseAdmin
-      .from('pralokmin_files')
+      .from("")
       .delete()
       .eq('bulan', bulan)

[Survived] StringLiteral
src/routes/files.js:58:11
     const { error: deleteDbError } = await supabaseAdmin
       .from('pralokmin_files')
       .delete()
-      .eq('bulan', bulan)
+      .eq("", bulan)
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis);

[Survived] StringLiteral
src/routes/files.js:60:11
       .delete()
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster))
-      .eq('jenis', jenis);
+      .eq("", jenis);
     if (deleteDbError) throw deleteDbError;
     res.json({ success: true, message: 'File berhasil dihapus' });

[Killed] ConditionalExpression
src/routes/files.js:61:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis);
-    if (deleteDbError) throw deleteDbError;
+    if (false) throw deleteDbError;
     res.json({ success: true, message: 'File berhasil dihapus' });
   } catch (err) {
killedBy: DELETE /api/file/:bulan/:klaster/:jenis handles database delete error for single file (branch deleteDbError)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/files.js:61:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis);
-    if (deleteDbError) throw deleteDbError;
+    if (true) throw deleteDbError;
     res.json({ success: true, message: 'File berhasil dihapus' });
   } catch (err) {
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
src/routes/files.js:62:25
       .eq('klaster', parseInt(klaster))
       .eq('jenis', jenis);
     if (deleteDbError) throw deleteDbError;
-    res.json({ success: true, message: 'File berhasil dihapus' });
+    res.json({ success: false, message: 'File berhasil dihapus' });
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: DELETE /api/file/:bulan/:klaster/:jenis deletes file when it exists
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "success"

Expected value: true
Received value: false

[Killed] BlockStatement
src/routes/files.js:63:17
       .eq('jenis', jenis);
     if (deleteDbError) throw deleteDbError;
     res.json({ success: true, message: 'File berhasil dihapus' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/file/:bulan/:klaster/:jenis returns 404 when file does not exist
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/files.js:74:15
     const bucketName = 'pralokmin-files';
     const { data, error } = await supabaseAdmin
       .from('pralokmin_files')
-      .select('klaster, jenis, storage_path, nama_file')
+      .select("")
       .eq('bulan', bulan);
     if (error) throw error;

[Survived] StringLiteral
src/routes/files.js:75:11
     const { data, error } = await supabaseAdmin
       .from('pralokmin_files')
       .select('klaster, jenis, storage_path, nama_file')
-      .eq('bulan', bulan);
+      .eq("", bulan);
     if (error) throw error;
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });

[Killed] ConditionalExpression
src/routes/files.js:76:9
       .from('pralokmin_files')
       .select('klaster, jenis, storage_path, nama_file')
       .eq('bulan', bulan);
-    if (error) throw error;
+    if (true) throw error;
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
     const zip = new JSZip();
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/routes/files.js:76:9
       .from('pralokmin_files')
       .select('klaster, jenis, storage_path, nama_file')
       .eq('bulan', bulan);
-    if (error) throw error;
+    if (false) throw error;
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
     const zip = new JSZip();

[Killed] ConditionalExpression
src/routes/files.js:77:9
       .select('klaster, jenis, storage_path, nama_file')
       .eq('bulan', bulan);
     if (error) throw error;
-    if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
+    if (true) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
     const zip = new JSZip();
     let gagalList = [];
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/routes/files.js:77:9
       .select('klaster, jenis, storage_path, nama_file')
       .eq('bulan', bulan);
     if (error) throw error;
-    if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
+    if (false) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
     const zip = new JSZip();
     let gagalList = [];
killedBy: GET /api/download/:bulan returns 404 when no files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BlockStatement
src/routes/files.js:80:29
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk bulan ini' });
     const zip = new JSZip();
     let gagalList = [];
-    for (const row of data) {
-      const { data: fileData, error: downloadError } = await supabaseAdmin.storage
-        .from(bucketName)
-        .download(row.storage_path);
-      if (downloadError) {
-        gagalList.push(row.nama_file);
-        continue;
-      }
-      const folderName = `Klaster_${row.klaster}`;
-      const buffer = Buffer.from(await fileData.arrayBuffer());
-      zip.folder(folderName).file(row.nama_file, buffer);
-    }
+    for (const row of data) {}
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/routes/files.js:84:11
       const { data: fileData, error: downloadError } = await supabaseAdmin.storage
         .from(bucketName)
         .download(row.storage_path);
-      if (downloadError) {
+      if (true) {
         gagalList.push(row.nama_file);
         continue;
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/routes/files.js:84:11
       const { data: fileData, error: downloadError } = await supabaseAdmin.storage
         .from(bucketName)
         .download(row.storage_path);
-      if (downloadError) {
+      if (false) {
         gagalList.push(row.nama_file);
         continue;
killedBy: GET /api/download/:bulan sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/routes/files.js:92:9
       const buffer = Buffer.from(await fileData.arrayBuffer());
       zip.folder(folderName).file(row.nama_file, buffer);
     }
-    if (Object.keys(zip.files).length === 0) {
+    if (false) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
killedBy: GET /api/download/:bulan returns 500 when all downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/files.js:92:9
       const buffer = Buffer.from(await fileData.arrayBuffer());
       zip.folder(folderName).file(row.nama_file, buffer);
     }
-    if (Object.keys(zip.files).length === 0) {
+    if (true) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
src/routes/files.js:93:44
       zip.folder(folderName).file(row.nama_file, buffer);
     }
     if (Object.keys(zip.files).length === 0) {
-      return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
+      return res.status(500).json({ error: "", gagal: gagalList });
     }
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });

[Killed] StringLiteral
src/routes/files.js:95:55
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
-    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
+    const zipBuffer = await zip.generateAsync({ type: "", compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);
killedBy: GET /api/download/:bulan returns application/zip when files exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ObjectLiteral
src/routes/files.js:95:113
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
-    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
+    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: {} });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);

[Survived] StringLiteral
src/routes/files.js:97:36
     }
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
-    res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);
+    res.set('Content-Disposition', ``);
     if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);

[Killed] ConditionalExpression
src/routes/files.js:98:9
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);
-    if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
+    if (false) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);
   } catch (err) {
killedBy: GET /api/download/:bulan sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/routes/files.js:98:9
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);
-    if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
+    if (gagalList.length <= 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);
   } catch (err) {
killedBy: GET /api/download/:bulan sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/routes/files.js:100:17
     res.set('Content-Disposition', `attachment; filename=Pralokmin_${bulan}.zip`);
     if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/download/:bulan returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/files.js:105:61
   }
 });
 
-router.delete('/files/:bulan/:klaster', async (req, res) => {
-  try {
-    const { bulan, klaster } = req.params;
-    const bucketName = 'pralokmin-files';
-    const { data: files, error: fetchError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('storage_path, jenis')
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (fetchError) throw fetchError;
-    if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
-    const paths = files.map(f => f.storage_path);
-    await supabaseAdmin.storage.from(bucketName).remove(paths);
-    const { error: deleteDbError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .delete()
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (deleteDbError) throw deleteDbError;
-    res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.delete('/files/:bulan/:klaster', async (req, res) => {});
 
 router.get('/download-klaster/:bulan/:klaster', async (req, res) => {
killedBy: DELETE /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
