[Killed] StringLiteral
src/routes/files.js:105:15
   }
 });
 
-router.delete('/files/:bulan/:klaster', async (req, res) => {
+router.delete("", async (req, res) => {
   try {
     const { bulan, klaster } = req.params;
killedBy: DELETE /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] BlockStatement
src/routes/files.js:106:7
 });
 
 router.delete('/files/:bulan/:klaster', async (req, res) => {
-  try {
-    const { bulan, klaster } = req.params;
-    const bucketName = 'pralokmin-files';
-    const { data: files, error: fetchError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .select('storage_path, jenis')
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (fetchError) throw fetchError;
-    if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
-    const paths = files.map(f => f.storage_path);
-    await supabaseAdmin.storage.from(bucketName).remove(paths);
-    const { error: deleteDbError } = await supabaseAdmin
-      .from('pralokmin_files')
-      .delete()
-      .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
-    if (deleteDbError) throw deleteDbError;
-    res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: DELETE /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/files.js:108:24
 router.delete('/files/:bulan/:klaster', async (req, res) => {
   try {
     const { bulan, klaster } = req.params;
-    const bucketName = 'pralokmin-files';
+    const bucketName = "";
     const { data: files, error: fetchError } = await supabaseAdmin
       .from('pralokmin_files')

[Survived] StringLiteral
src/routes/files.js:110:13
     const { bulan, klaster } = req.params;
     const bucketName = 'pralokmin-files';
     const { data: files, error: fetchError } = await supabaseAdmin
-      .from('pralokmin_files')
+      .from("")
       .select('storage_path, jenis')
       .eq('bulan', bulan)

[Killed] ConditionalExpression
src/routes/files.js:114:9
       .select('storage_path, jenis')
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (fetchError) throw fetchError;
+    if (false) throw fetchError;
     if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const paths = files.map(f => f.storage_path);
killedBy: DELETE /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] ConditionalExpression
src/routes/files.js:114:9
       .select('storage_path, jenis')
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (fetchError) throw fetchError;
+    if (true) throw fetchError;
     if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const paths = files.map(f => f.storage_path);
killedBy: DELETE /api/files/:bulan/:klaster deletes all files in a cluster
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
src/routes/files.js:115:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
     if (fetchError) throw fetchError;
-    if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
+    if (files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const paths = files.map(f => f.storage_path);
     await supabaseAdmin.storage.from(bucketName).remove(paths);
killedBy: DELETE /api/files/:bulan/:klaster deletes all files in a cluster
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/routes/files.js:115:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
     if (fetchError) throw fetchError;
-    if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
+    if (true) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const paths = files.map(f => f.storage_path);
     await supabaseAdmin.storage.from(bucketName).remove(paths);
killedBy: DELETE /api/files/:bulan/:klaster deletes all files in a cluster
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] ArrowFunction
src/routes/files.js:116:29
       .eq('klaster', parseInt(klaster));
     if (fetchError) throw fetchError;
     if (!files || files.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
-    const paths = files.map(f => f.storage_path);
+    const paths = files.map(() => undefined);
     await supabaseAdmin.storage.from(bucketName).remove(paths);
     const { error: deleteDbError } = await supabaseAdmin

[Killed] ConditionalExpression
src/routes/files.js:123:9
       .delete()
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (deleteDbError) throw deleteDbError;
+    if (false) throw deleteDbError;
     res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
   } catch (err) {
killedBy: DELETE /api/files/:bulan/:klaster handles database delete error for cluster files (branch deleteDbError)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/files.js:123:9
       .delete()
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
-    if (deleteDbError) throw deleteDbError;
+    if (true) throw deleteDbError;
     res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
   } catch (err) {
killedBy: DELETE /api/files/:bulan/:klaster deletes all files in a cluster
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
src/routes/files.js:124:25
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
     if (deleteDbError) throw deleteDbError;
-    res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
+    res.json({ success: false, message: `Semua file Klaster ${klaster} berhasil dihapus` });
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: DELETE /api/files/:bulan/:klaster deletes all files in a cluster
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "success"

Expected value: true
Received value: false

[Killed] BlockStatement
src/routes/files.js:125:17
       .eq('klaster', parseInt(klaster));
     if (deleteDbError) throw deleteDbError;
     res.json({ success: true, message: `Semua file Klaster ${klaster} berhasil dihapus` });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/files/:bulan/:klaster returns 500 on database error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/files.js:136:15
     const bucketName = 'pralokmin-files';
     const { data, error } = await supabaseAdmin
       .from('pralokmin_files')
-      .select('jenis, storage_path, nama_file')
+      .select("")
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));

[Survived] StringLiteral
src/routes/files.js:138:11
       .from('pralokmin_files')
       .select('jenis, storage_path, nama_file')
       .eq('bulan', bulan)
-      .eq('klaster', parseInt(klaster));
+      .eq("", parseInt(klaster));
     if (error) throw error;
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });

[Killed] ConditionalExpression
src/routes/files.js:140:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
     if (error) throw error;
-    if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
+    if (true) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const zip = new JSZip();
     let gagalList = [];
killedBy: GET /api/download-klaster/:bulan/:klaster returns 500 when all downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Killed] EqualityOperator
src/routes/files.js:140:9
       .eq('bulan', bulan)
       .eq('klaster', parseInt(klaster));
     if (error) throw error;
-    if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
+    if (data.length !== 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const zip = new JSZip();
     let gagalList = [];
killedBy: GET /api/download-klaster/:bulan/:klaster returns 500 when all downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 404

[Survived] ArrayDeclaration
src/routes/files.js:142:21
     if (error) throw error;
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const zip = new JSZip();
-    let gagalList = [];
+    let gagalList = ["Stryker was here"];
     for (const row of data) {
       const { data: fileData, error: downloadError } = await supabaseAdmin.storage

[Killed] BlockStatement
src/routes/files.js:143:29
     if (data.length === 0) return res.status(404).json({ error: 'Tidak ada file untuk klaster ini' });
     const zip = new JSZip();
     let gagalList = [];
-    for (const row of data) {
-      const { data: fileData, error: downloadError } = await supabaseAdmin.storage
-        .from(bucketName)
-        .download(row.storage_path);
-      if (downloadError) {
-        gagalList.push(row.nama_file);
-        continue;
-      }
-      const jenisLabel = { undangan: 'Undangan', notulen: 'Notulen', daftar_hadir: 'Daftar Hadir', lampiran: 'Lampiran' }[row.jenis] || row.jenis;
-      const buffer = Buffer.from(await fileData.arrayBuffer());
-      zip.file(`${jenisLabel}_${row.nama_file}`, buffer);
-    }
+    for (const row of data) {}
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] LogicalOperator
src/routes/files.js:151:26
         gagalList.push(row.nama_file);
         continue;
       }
-      const jenisLabel = { undangan: 'Undangan', notulen: 'Notulen', daftar_hadir: 'Daftar Hadir', lampiran: 'Lampiran' }[row.jenis] || row.jenis;
+      const jenisLabel = {
+  undangan: 'Undangan',
+  notulen: 'Notulen',
+  daftar_hadir: 'Daftar Hadir',
+  lampiran: 'Lampiran'
+}[row.jenis] && row.jenis;
       const buffer = Buffer.from(await fileData.arrayBuffer());
       zip.file(`${jenisLabel}_${row.nama_file}`, buffer);

[Survived] ConditionalExpression
src/routes/files.js:151:26
         gagalList.push(row.nama_file);
         continue;
       }
-      const jenisLabel = { undangan: 'Undangan', notulen: 'Notulen', daftar_hadir: 'Daftar Hadir', lampiran: 'Lampiran' }[row.jenis] || row.jenis;
+      const jenisLabel = false;
       const buffer = Buffer.from(await fileData.arrayBuffer());
       zip.file(`${jenisLabel}_${row.nama_file}`, buffer);

[Killed] EqualityOperator
src/routes/files.js:155:9
       const buffer = Buffer.from(await fileData.arrayBuffer());
       zip.file(`${jenisLabel}_${row.nama_file}`, buffer);
     }
-    if (Object.keys(zip.files).length === 0) {
+    if (Object.keys(zip.files).length !== 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
killedBy: GET /api/download-klaster/:bulan/:klaster returns 500 when all downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ObjectLiteral
src/routes/files.js:156:35
       zip.file(`${jenisLabel}_${row.nama_file}`, buffer);
     }
     if (Object.keys(zip.files).length === 0) {
-      return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
+      return res.status(500).json({});
     }
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
killedBy: GET /api/download-klaster/:bulan/:klaster returns 500 when all downloads fail
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "error"
Received path: []

Received value: {}

[Killed] ObjectLiteral
src/routes/files.js:158:47
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
-    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
+    const zipBuffer = await zip.generateAsync({});
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_Klaster${klaster}_${bulan}.zip`);
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] StringLiteral
src/routes/files.js:158:82
     if (Object.keys(zip.files).length === 0) {
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
-    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
+    const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: "", compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_Klaster${klaster}_${bulan}.zip`);
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] StringLiteral
src/routes/files.js:159:13
       return res.status(500).json({ error: 'Tidak ada file yang berhasil diambil dari storage.', gagal: gagalList });
     }
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
-    res.set('Content-Type', 'application/zip');
+    res.set("", 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_Klaster${klaster}_${bulan}.zip`);
     if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
src/routes/files.js:161:9
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_Klaster${klaster}_${bulan}.zip`);
-    if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
+    if (gagalList.length <= 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);
   } catch (err) {
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/routes/files.js:161:9
     const zipBuffer = await zip.generateAsync({ type: 'nodebuffer', compression: 'DEFLATE', compressionOptions: { level: 6 } });
     res.set('Content-Type', 'application/zip');
     res.set('Content-Disposition', `attachment; filename=Pralokmin_Klaster${klaster}_${bulan}.zip`);
-    if (gagalList.length > 0) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
+    if (false) res.set('X-Gagal-Files', encodeURIComponent(gagalList.join(', ')));
     res.send(zipBuffer);
   } catch (err) {
killedBy: GET /api/download-klaster/:bulan/:klaster sets X-Gagal-Files header when some downloads fail
statusReason: Error: expect(received).toBeDefined()

Received: undefined
