[Killed] BlockStatement
src/routes/indicators.js:6:37
 
 const router = Router();
 
-router.get('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { data, error } = await supabase
-      .from('indicators')
-      .select('*')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .order('nama');
-    if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
-    res.json(rows);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/', async (req, res) => {});
 
 router.post('/', async (req, res) => {
killedBy: GET /api/indicators returns list with bor as boolean
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/indicators.js:6:12
 
 const router = Router();
 
-router.get('/', async (req, res) => {
+router.get("", async (req, res) => {
   try {
     const klaster = req.query.klaster || 5;

[Killed] BlockStatement
src/routes/indicators.js:7:7
 const router = Router();
 
 router.get('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { data, error } = await supabase
-      .from('indicators')
-      .select('*')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .order('nama');
-    if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
-    res.json(rows);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: GET /api/indicators returns list with bor as boolean
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] LogicalOperator
src/routes/indicators.js:8:21
 
 router.get('/', async (req, res) => {
   try {
-    const klaster = req.query.klaster || 5;
+    const klaster = req.query.klaster && 5;
     const { data, error } = await supabase
       .from('indicators')

[Survived] StringLiteral
src/routes/indicators.js:10:13
   try {
     const klaster = req.query.klaster || 5;
     const { data, error } = await supabase
-      .from('indicators')
+      .from("")
       .select('*')
       .or(`klaster.eq.${klaster},klaster.is.null`)

[Survived] StringLiteral
src/routes/indicators.js:11:15
     const klaster = req.query.klaster || 5;
     const { data, error } = await supabase
       .from('indicators')
-      .select('*')
+      .select("")
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .order('nama');

[Survived] StringLiteral
src/routes/indicators.js:12:11
     const { data, error } = await supabase
       .from('indicators')
       .select('*')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
+      .or(``)
       .order('nama');
     if (error) throw error;

[Killed] ConditionalExpression
src/routes/indicators.js:14:9
       .select('*')
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .order('nama');
-    if (error) throw error;
+    if (true) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
killedBy: GET /api/indicators returns list with bor as boolean
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/indicators.js:14:9
       .select('*')
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .order('nama');
-    if (error) throw error;
+    if (false) throw error;
     const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
     res.json(rows);
killedBy: Error handling returns 500 on database error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BooleanLiteral
src/routes/indicators.js:15:54
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .order('nama');
     if (error) throw error;
-    const rows = (data || []).map(r => ({ ...r, bor: !!r.bor }));
+    const rows = (data || []).map(r => ({ ...r, bor: !r.bor }));
     res.json(rows);
   } catch (err) {
killedBy: GET /api/indicators returns list with bor as boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/routes/indicators.js:22:38
   }
 });
 
-router.post('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const d = req.body;
-    if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
-    if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
-    const { data, error } = await supabase
-      .from('indicators')
-      .insert({
-        klaster: parseInt(klaster),
-        unit: d.unit,
-        nama: d.nama.trim(),
-        target: d.target ?? '',
-        satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
-      })
-      .select();
-    if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Indikator ditambahkan.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.post('/', async (req, res) => {});
 
 router.put('/:id', async (req, res) => {
killedBy: POST /api/indicators creates indicator with valid data
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/indicators.js:23:7
 });
 
 router.post('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const d = req.body;
-    if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
-    if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
-    const { data, error } = await supabase
-      .from('indicators')
-      .insert({
-        klaster: parseInt(klaster),
-        unit: d.unit,
-        nama: d.nama.trim(),
-        target: d.target ?? '',
-        satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
-      })
-      .select();
-    if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Indikator ditambahkan.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: POST /api/indicators creates indicator with valid data
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
src/routes/indicators.js:26:20
   try {
     const klaster = req.query.klaster || 5;
     const d = req.body;
-    if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
+    if (!d.nama || d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
     if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
     const { data, error } = await supabase
killedBy: POST /api/indicators creates indicator with valid data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
src/routes/indicators.js:26:9
   try {
     const klaster = req.query.klaster || 5;
     const d = req.body;
-    if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
+    if (d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
     if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
     const { data, error } = await supabase
killedBy: POST /api/indicators creates indicator with valid data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/routes/indicators.js:27:9
     const klaster = req.query.klaster || 5;
     const d = req.body;
     if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
-    if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
+    if (false) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
     const { data, error } = await supabase
       .from('indicators')
killedBy: POST /api/indicators rejects missing unit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BooleanLiteral
src/routes/indicators.js:27:9
     const klaster = req.query.klaster || 5;
     const d = req.body;
     if (!d.nama || !d.nama.trim()) return res.status(400).json({ error: 'Nama indikator wajib diisi.' });
-    if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
+    if (d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
     const { data, error } = await supabase
       .from('indicators')
killedBy: POST /api/indicators creates indicator with valid data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] ObjectLiteral
src/routes/indicators.js:30:15
     if (!d.unit) return res.status(400).json({ error: 'Pilih unit pelayanan.' });
     const { data, error } = await supabase
       .from('indicators')
-      .insert({
-        klaster: parseInt(klaster),
-        unit: d.unit,
-        nama: d.nama.trim(),
-        target: d.target ?? '',
-        satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
-      })
+      .insert({})
       .select();
     if (error) throw error;

[Survived] MethodExpression
src/routes/indicators.js:33:15
       .insert({
         klaster: parseInt(klaster),
         unit: d.unit,
-        nama: d.nama.trim(),
+        nama: d.nama,
         target: d.target ?? '',
         satuan: d.satuan || 'persen',

[Survived] LogicalOperator
src/routes/indicators.js:34:17
         klaster: parseInt(klaster),
         unit: d.unit,
         nama: d.nama.trim(),
-        target: d.target ?? '',
+        target: d.target && '',
         satuan: d.satuan || 'persen',
         mode_bulanan: d.modeBulanan || 'bagi12',

[Survived] ConditionalExpression
src/routes/indicators.js:35:17
         unit: d.unit,
         nama: d.nama.trim(),
         target: d.target ?? '',
-        satuan: d.satuan || 'persen',
+        satuan: true,
         mode_bulanan: d.modeBulanan || 'bagi12',
         bor: d.bor ? true : false

[Survived] LogicalOperator
src/routes/indicators.js:35:17
         unit: d.unit,
         nama: d.nama.trim(),
         target: d.target ?? '',
-        satuan: d.satuan || 'persen',
+        satuan: d.satuan && 'persen',
         mode_bulanan: d.modeBulanan || 'bagi12',
         bor: d.bor ? true : false

[Survived] ConditionalExpression
src/routes/indicators.js:36:23
         nama: d.nama.trim(),
         target: d.target ?? '',
         satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
+        mode_bulanan: false,
         bor: d.bor ? true : false
       })

[Survived] ConditionalExpression
src/routes/indicators.js:36:23
         nama: d.nama.trim(),
         target: d.target ?? '',
         satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
+        mode_bulanan: true,
         bor: d.bor ? true : false
       })

[Survived] BooleanLiteral
src/routes/indicators.js:37:22
         target: d.target ?? '',
         satuan: d.satuan || 'persen',
         mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
+        bor: d.bor ? false : false
       })
       .select();

[Survived] BooleanLiteral
src/routes/indicators.js:37:29
         target: d.target ?? '',
         satuan: d.satuan || 'persen',
         mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
+        bor: d.bor ? true : true
       })
       .select();

[Survived] StringLiteral
src/routes/indicators.js:41:53
       })
       .select();
     if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Indikator ditambahkan.' });
+    res.status(201).json({ id: data[0].id, message: "" });
   } catch (err) {
     res.status(500).json({ error: err.message });

[Killed] BlockStatement
src/routes/indicators.js:42:17
       .select();
     if (error) throw error;
     res.status(201).json({ id: data[0].id, message: 'Indikator ditambahkan.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/indicators returns 500 when insert fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/indicators.js:47:40
   }
 });
 
-router.put('/:id', async (req, res) => {
-  try {
-    const d = req.body;
-    const { error } = await supabase
-      .from('indicators')
-      .update({
-        unit: d.unit,
-        nama: d.nama.trim(),
-        target: d.target ?? '',
-        satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
-      })
-      .eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Indikator diperbarui.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.put('/:id', async (req, res) => {});
 
 router.delete('/:id', async (req, res) => {
killedBy: PUT /api/indicators/:id updates indicator
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/indicators.js:48:7
 });
 
 router.put('/:id', async (req, res) => {
-  try {
-    const d = req.body;
-    const { error } = await supabase
-      .from('indicators')
-      .update({
-        unit: d.unit,
-        nama: d.nama.trim(),
-        target: d.target ?? '',
-        satuan: d.satuan || 'persen',
-        mode_bulanan: d.modeBulanan || 'bagi12',
-        bor: d.bor ? true : false
-      })
-      .eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Indikator diperbarui.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: PUT /api/indicators/:id updates indicator
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/indicators.js:55:29
       .update({
         unit: d.unit,
         nama: d.nama.trim(),
-        target: d.target ?? '',
+        target: d.target ?? "Stryker was here!",
         satuan: d.satuan || 'persen',
         mode_bulanan: d.modeBulanan || 'bagi12',

[Survived] ConditionalExpression
src/routes/indicators.js:56:17
         unit: d.unit,
         nama: d.nama.trim(),
         target: d.target ?? '',
-        satuan: d.satuan || 'persen',
+        satuan: false,
         mode_bulanan: d.modeBulanan || 'bagi12',
         bor: d.bor ? true : false

[Killed] BlockStatement
src/routes/indicators.js:63:17
       .eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Indikator diperbarui.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/indicators/:id returns 500 when update fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/indicators.js:68:43
   }
 });
 
-router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Indikator dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.delete('/:id', async (req, res) => {});
 
 module.exports = router;
killedBy: DELETE /api/indicators/:id deletes indicator
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/indicators.js:69:7
 });
 
 router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Indikator dihapus.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: DELETE /api/indicators/:id deletes indicator
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/indicators.js:71:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (true) throw error;
     res.json({ message: 'Indikator dihapus.' });
   } catch (err) {
killedBy: DELETE /api/indicators/:id deletes indicator
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/indicators.js:71:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (false) throw error;
     res.json({ message: 'Indikator dihapus.' });
   } catch (err) {
killedBy: DELETE /api/indicators/:id returns 500 when delete fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ObjectLiteral
src/routes/indicators.js:72:14
   try {
     const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
     if (error) throw error;
-    res.json({ message: 'Indikator dihapus.' });
+    res.json({});
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: DELETE /api/indicators/:id deletes indicator
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "message"
Received path: []

Received value: {}

[Killed] BlockStatement
src/routes/indicators.js:73:17
     const { error } = await supabase.from('indicators').delete().eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Indikator dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/indicators/:id returns 500 when delete fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
