[Killed] BlockStatement
src/routes/units.js:6:37
 
 const router = Router();
 
-router.get('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { data, error } = await supabase
-      .from('units')
-      .select('*')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .order('nama');
-    if (error) throw error;
-    res.json(data);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.get('/', async (req, res) => {});
 
 router.post('/', async (req, res) => {
killedBy: CORS includes Access-Control-Allow-Origin for whitelisted origin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/units.js:7:7
 const router = Router();
 
 router.get('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { data, error } = await supabase
-      .from('units')
-      .select('*')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .order('nama');
-    if (error) throw error;
-    res.json(data);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: CORS includes Access-Control-Allow-Origin for whitelisted origin
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/units.js:10:13
   try {
     const klaster = req.query.klaster || 5;
     const { data, error } = await supabase
-      .from('units')
+      .from("")
       .select('*')
       .or(`klaster.eq.${klaster},klaster.is.null`)

[Killed] BlockStatement
src/routes/units.js:21:38
   }
 });
 
-router.post('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { nama } = req.body;
-    if (!nama || !nama.trim()) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
-    const { data: existing } = await supabase
-      .from('units')
-      .select('id')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .ilike('nama', nama.trim());
-    if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
-    const { data, error } = await supabase
-      .from('units')
-      .insert({ klaster: parseInt(klaster), nama: nama.trim() })
-      .select();
-    if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Unit ditambahkan.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.post('/', async (req, res) => {});
 
 router.delete('/:id', async (req, res) => {
killedBy: POST /api/units creates unit with valid name
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/units.js:22:7
 });
 
 router.post('/', async (req, res) => {
-  try {
-    const klaster = req.query.klaster || 5;
-    const { nama } = req.body;
-    if (!nama || !nama.trim()) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
-    const { data: existing } = await supabase
-      .from('units')
-      .select('id')
-      .or(`klaster.eq.${klaster},klaster.is.null`)
-      .ilike('nama', nama.trim());
-    if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
-    const { data, error } = await supabase
-      .from('units')
-      .insert({ klaster: parseInt(klaster), nama: nama.trim() })
-      .select();
-    if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Unit ditambahkan.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: POST /api/units creates unit with valid name
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/units.js:25:9
   try {
     const klaster = req.query.klaster || 5;
     const { nama } = req.body;
-    if (!nama || !nama.trim()) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
+    if (false) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
     const { data: existing } = await supabase
       .from('units')
killedBy: POST /api/units rejects empty name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/routes/units.js:25:9
   try {
     const klaster = req.query.klaster || 5;
     const { nama } = req.body;
-    if (!nama || !nama.trim()) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
+    if (true) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
     const { data: existing } = await supabase
       .from('units')
killedBy: POST /api/units creates unit with valid name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] StringLiteral
src/routes/units.js:28:15
     if (!nama || !nama.trim()) return res.status(400).json({ error: 'Nama unit wajib diisi.' });
     const { data: existing } = await supabase
       .from('units')
-      .select('id')
+      .select("")
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .ilike('nama', nama.trim());

[Survived] MethodExpression
src/routes/units.js:30:22
       .from('units')
       .select('id')
       .or(`klaster.eq.${klaster},klaster.is.null`)
-      .ilike('nama', nama.trim());
+      .ilike('nama', nama);
     if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
     const { data, error } = await supabase

[Killed] LogicalOperator
src/routes/units.js:31:9
       .select('id')
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .ilike('nama', nama.trim());
-    if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
+    if (existing || existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
     const { data, error } = await supabase
       .from('units')
killedBy: POST /api/units creates unit with valid name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
src/routes/units.js:31:9
       .select('id')
       .or(`klaster.eq.${klaster},klaster.is.null`)
       .ilike('nama', nama.trim());
-    if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
+    if (true) return res.status(400).json({ error: 'Unit itu sudah ada.' });
     const { data, error } = await supabase
       .from('units')
killedBy: POST /api/units creates unit with valid name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] MethodExpression
src/routes/units.js:34:51
     if (existing && existing.length > 0) return res.status(400).json({ error: 'Unit itu sudah ada.' });
     const { data, error } = await supabase
       .from('units')
-      .insert({ klaster: parseInt(klaster), nama: nama.trim() })
+      .insert({ klaster: parseInt(klaster), nama: nama })
       .select();
     if (error) throw error;

[Killed] ObjectLiteral
src/routes/units.js:37:26
       .insert({ klaster: parseInt(klaster), nama: nama.trim() })
       .select();
     if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Unit ditambahkan.' });
+    res.status(201).json({});
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: POST /api/units creates unit with valid name
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "id"
Received path: []

Expected value: 99
Received value: {}

[Survived] StringLiteral
src/routes/units.js:37:53
       .insert({ klaster: parseInt(klaster), nama: nama.trim() })
       .select();
     if (error) throw error;
-    res.status(201).json({ id: data[0].id, message: 'Unit ditambahkan.' });
+    res.status(201).json({ id: data[0].id, message: "" });
   } catch (err) {
     res.status(500).json({ error: err.message });

[Killed] BlockStatement
src/routes/units.js:38:17
       .select();
     if (error) throw error;
     res.status(201).json({ id: data[0].id, message: 'Unit ditambahkan.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/units returns 500 when insert fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/units.js:43:43
   }
 });
 
-router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('units').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Unit dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-});
+router.delete('/:id', async (req, res) => {});
 
 module.exports = router;
killedBy: DELETE /api/units/:id deletes unit by id
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/routes/units.js:44:7
 });
 
 router.delete('/:id', async (req, res) => {
-  try {
-    const { error } = await supabase.from('units').delete().eq('id', req.params.id);
-    if (error) throw error;
-    res.json({ message: 'Unit dihapus.' });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: DELETE /api/units/:id deletes unit by id
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/routes/units.js:45:43
 
 router.delete('/:id', async (req, res) => {
   try {
-    const { error } = await supabase.from('units').delete().eq('id', req.params.id);
+    const { error } = await supabase.from("").delete().eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Unit dihapus.' });

[Survived] StringLiteral
src/routes/units.js:45:64
 
 router.delete('/:id', async (req, res) => {
   try {
-    const { error } = await supabase.from('units').delete().eq('id', req.params.id);
+    const { error } = await supabase.from('units').delete().eq("", req.params.id);
     if (error) throw error;
     res.json({ message: 'Unit dihapus.' });

[Killed] ConditionalExpression
src/routes/units.js:46:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('units').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (false) throw error;
     res.json({ message: 'Unit dihapus.' });
   } catch (err) {
killedBy: DELETE /api/units/:id returns 500 when delete fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/units.js:46:9
 router.delete('/:id', async (req, res) => {
   try {
     const { error } = await supabase.from('units').delete().eq('id', req.params.id);
-    if (error) throw error;
+    if (true) throw error;
     res.json({ message: 'Unit dihapus.' });
   } catch (err) {
killedBy: DELETE /api/units/:id deletes unit by id
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/routes/units.js:47:14
   try {
     const { error } = await supabase.from('units').delete().eq('id', req.params.id);
     if (error) throw error;
-    res.json({ message: 'Unit dihapus.' });
+    res.json({});
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: DELETE /api/units/:id deletes unit by id
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "message"
Received path: []

Received value: {}

[Survived] StringLiteral
src/routes/units.js:47:25
   try {
     const { error } = await supabase.from('units').delete().eq('id', req.params.id);
     if (error) throw error;
-    res.json({ message: 'Unit dihapus.' });
+    res.json({ message: "" });
   } catch (err) {
     res.status(500).json({ error: err.message });

[Killed] BlockStatement
src/routes/units.js:48:17
     const { error } = await supabase.from('units').delete().eq('id', req.params.id);
     if (error) throw error;
     res.json({ message: 'Unit dihapus.' });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/units/:id returns 500 when delete fails
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
