[Killed] ArithmeticOperator
src/routes/upload.js:11:23
 const storage = multer.memoryStorage();
 const upload = multer({
   storage,
-  limits: { fileSize: 10 * 1024 * 1024 },
+  limits: { fileSize: 10 * 1024 / 1024 },
   fileFilter: (req, file, cb) => {
     if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ArithmeticOperator
src/routes/upload.js:11:23
 const storage = multer.memoryStorage();
 const upload = multer({
   storage,
-  limits: { fileSize: 10 * 1024 * 1024 },
+  limits: { fileSize: 10 / 1024 * 1024 },
   fileFilter: (req, file, cb) => {
     if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/routes/upload.js:12:34
 const upload = multer({
   storage,
   limits: { fileSize: 10 * 1024 * 1024 },
-  fileFilter: (req, file, cb) => {
-    if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
-      cb(null, true);
-    } else {
-      cb(new Error('Hanya file PDF'), false);
-    }
-  }
+  fileFilter: (req, file, cb) => {}
 }).fields([
   { name: 'undangan', maxCount: 1 },
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/routes/upload.js:13:9
   storage,
   limits: { fileSize: 10 * 1024 * 1024 },
   fileFilter: (req, file, cb) => {
-    if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
+    if (false) {
       cb(null, true);
     } else {
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/routes/upload.js:13:9
   storage,
   limits: { fileSize: 10 * 1024 * 1024 },
   fileFilter: (req, file, cb) => {
-    if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
+    if (true) {
       cb(null, true);
     } else {
killedBy: POST /api/upload rejects non-PDF files with error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
src/routes/upload.js:14:16
   limits: { fileSize: 10 * 1024 * 1024 },
   fileFilter: (req, file, cb) => {
     if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
-      cb(null, true);
+      cb(null, false);
     } else {
       cb(new Error('Hanya file PDF'), false);
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/routes/upload.js:15:12
   fileFilter: (req, file, cb) => {
     if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
       cb(null, true);
-    } else {
-      cb(new Error('Hanya file PDF'), false);
-    }
+    } else {}
   }
 }).fields([
killedBy: Error handler handles non-PDF file error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] BooleanLiteral
src/routes/upload.js:16:39
     if (file.mimetype === 'application/pdf' || file.originalname.endsWith('.pdf')) {
       cb(null, true);
     } else {
-      cb(new Error('Hanya file PDF'), false);
+      cb(new Error('Hanya file PDF'), true);
     }
   }

[Killed] StringLiteral
src/routes/upload.js:20:11
     }
   }
 }).fields([
-  { name: 'undangan', maxCount: 1 },
+  { name: "", maxCount: 1 },
   { name: 'notulen', maxCount: 1 },
   { name: 'daftar_hadir', maxCount: 1 },
killedBy: Error handler handles multer LIMIT_FILE_SIZE error
statusReason: Error: read ECONNRESET

[Survived] ObjectLiteral
src/routes/upload.js:22:3
 }).fields([
   { name: 'undangan', maxCount: 1 },
   { name: 'notulen', maxCount: 1 },
-  { name: 'daftar_hadir', maxCount: 1 },
+  {},
   { name: 'lampiran', maxCount: 1 }
 ]);

[Killed] BlockStatement
src/routes/upload.js:29:29
 router.post('/', upload, async (req, res) => {
   try {
     const { bulan, klaster } = req.body;
-    if (!bulan || !klaster) {
-      return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
-    }
+    if (!bulan || !klaster) {}
     const files = req.files || {};
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
killedBy: POST /api/upload returns 400 when bulan and klaster are missing
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "error"

Expected value: "Bulan dan Klaster wajib diisi"
Received value: "Tidak ada file yang diupload"

[Killed] ConditionalExpression
src/routes/upload.js:29:9
 router.post('/', upload, async (req, res) => {
   try {
     const { bulan, klaster } = req.body;
-    if (!bulan || !klaster) {
+    if (true) {
       return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
     }
killedBy: POST /api/upload returns 400 when no files are uploaded
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "error"

Expected value: "Tidak ada file yang diupload"
Received value: "Bulan dan Klaster wajib diisi"

[Survived] BooleanLiteral
src/routes/upload.js:30:46
   try {
     const { bulan, klaster } = req.body;
     if (!bulan || !klaster) {
-      return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
+      return res.status(400).json({ success: true, error: 'Bulan dan Klaster wajib diisi' });
     }
     const files = req.files || {};

[Killed] StringLiteral
src/routes/upload.js:30:60
   try {
     const { bulan, klaster } = req.body;
     if (!bulan || !klaster) {
-      return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
+      return res.status(400).json({ success: false, error: "" });
     }
     const files = req.files || {};
killedBy: POST /api/upload returns 400 when bulan and klaster are missing
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "error"

Expected value: "Bulan dan Klaster wajib diisi"
Received value: ""

[Killed] ConditionalExpression
src/routes/upload.js:32:19
     if (!bulan || !klaster) {
       return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
     }
-    const files = req.files || {};
+    const files = false;
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
src/routes/upload.js:32:19
     if (!bulan || !klaster) {
       return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
     }
-    const files = req.files || {};
+    const files = req.files && {};
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
src/routes/upload.js:33:22
       return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
     }
     const files = req.files || {};
-    const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
+    const jenisMap = {};
     const bucketName = 'pralokmin-files';
     if (Object.keys(files).length === 0) {
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] StringLiteral
src/routes/upload.js:33:34
       return res.status(400).json({ success: false, error: 'Bulan dan Klaster wajib diisi' });
     }
     const files = req.files || {};
-    const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
+    const jenisMap = { undangan: "", notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
     if (Object.keys(files).length === 0) {
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/upload.js:35:9
     const files = req.files || {};
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
-    if (Object.keys(files).length === 0) {
+    if (false) {
       return res.status(400).json({ success: false, error: 'Tidak ada file yang diupload' });
     }
killedBy: POST /api/upload returns 400 when no files are uploaded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
src/routes/upload.js:35:9
     const files = req.files || {};
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
-    if (Object.keys(files).length === 0) {
+    if (true) {
       return res.status(400).json({ success: false, error: 'Tidak ada file yang diupload' });
     }
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] BooleanLiteral
src/routes/upload.js:36:46
     const jenisMap = { undangan: 'undangan', notulen: 'notulen', daftar_hadir: 'daftar_hadir', lampiran: 'lampiran' };
     const bucketName = 'pralokmin-files';
     if (Object.keys(files).length === 0) {
-      return res.status(400).json({ success: false, error: 'Tidak ada file yang diupload' });
+      return res.status(400).json({ success: true, error: 'Tidak ada file yang diupload' });
     }
     for (const [key, fileArray] of Object.entries(files)) {

[Killed] BooleanLiteral
src/routes/upload.js:42:11
       const jenis = jenisMap[key];
       // dead code — multer.fields() already rejects unknown field names
       /* istanbul ignore next */
-      if (!jenis) continue;
+      if (jenis) continue;
       const file = fileArray[0];
       const fileExt = path.extname(file.originalname);
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/upload.js:42:11
       const jenis = jenisMap[key];
       // dead code — multer.fields() already rejects unknown field names
       /* istanbul ignore next */
-      if (!jenis) continue;
+      if (true) continue;
       const file = fileArray[0];
       const fileExt = path.extname(file.originalname);
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Survived] StringLiteral
src/routes/upload.js:52:25
         .from(bucketName)
         .upload(storagePath, file.buffer, {
           contentType: file.mimetype,
-          cacheControl: '3600',
+          cacheControl: "",
           upsert: false
         });

[Survived] BooleanLiteral
src/routes/upload.js:53:19
         .upload(storagePath, file.buffer, {
           contentType: file.mimetype,
           cacheControl: '3600',
-          upsert: false
+          upsert: true
         });
       if (uploadError) {

[Killed] BlockStatement
src/routes/upload.js:55:24
           cacheControl: '3600',
           upsert: false
         });
-      if (uploadError) {
-        throw new Error(`Gagal upload ${jenis}: ${uploadError.message}`);
-      }
+      if (uploadError) {}
       const { error: insertError } = await supabaseAdmin
         .from('pralokmin_files')
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] ConditionalExpression
src/routes/upload.js:55:11
           cacheControl: '3600',
           upsert: false
         });
-      if (uploadError) {
+      if (false) {
         throw new Error(`Gagal upload ${jenis}: ${uploadError.message}`);
       }
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Survived] StringLiteral
src/routes/upload.js:56:25
           upsert: false
         });
       if (uploadError) {
-        throw new Error(`Gagal upload ${jenis}: ${uploadError.message}`);
+        throw new Error(``);
       }
       const { error: insertError } = await supabaseAdmin

[Survived] StringLiteral
src/routes/upload.js:59:15
         throw new Error(`Gagal upload ${jenis}: ${uploadError.message}`);
       }
       const { error: insertError } = await supabaseAdmin
-        .from('pralokmin_files')
+        .from("")
         .upsert({
           bulan,

[Survived] ObjectLiteral
src/routes/upload.js:67:12
           nama_file: file.originalname,
           storage_path: storagePath,
           ukuran: file.size
-        }, { onConflict: 'bulan, klaster, jenis' });
+        }, {});
       if (insertError) {
         await supabaseAdmin.storage.from(bucketName).remove([storagePath]);

[Survived] StringLiteral
src/routes/upload.js:67:26
           nama_file: file.originalname,
           storage_path: storagePath,
           ukuran: file.size
-        }, { onConflict: 'bulan, klaster, jenis' });
+        }, { onConflict: "" });
       if (insertError) {
         await supabaseAdmin.storage.from(bucketName).remove([storagePath]);

[Killed] ConditionalExpression
src/routes/upload.js:68:11
           storage_path: storagePath,
           ukuran: file.size
         }, { onConflict: 'bulan, klaster, jenis' });
-      if (insertError) {
+      if (false) {
         await supabaseAdmin.storage.from(bucketName).remove([storagePath]);
         throw new Error(`Gagal simpan metadata ${jenis}: ${insertError.message}`);
killedBy: POST /api/upload handles database insert failure after upload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
src/routes/upload.js:68:24
           storage_path: storagePath,
           ukuran: file.size
         }, { onConflict: 'bulan, klaster, jenis' });
-      if (insertError) {
-        await supabaseAdmin.storage.from(bucketName).remove([storagePath]);
-        throw new Error(`Gagal simpan metadata ${jenis}: ${insertError.message}`);
-      }
+      if (insertError) {}
     }
     res.json({ success: true, message: 'Upload berhasil' });
killedBy: POST /api/upload handles database insert failure after upload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Survived] StringLiteral
src/routes/upload.js:70:25
         }, { onConflict: 'bulan, klaster, jenis' });
       if (insertError) {
         await supabaseAdmin.storage.from(bucketName).remove([storagePath]);
-        throw new Error(`Gagal simpan metadata ${jenis}: ${insertError.message}`);
+        throw new Error(``);
       }
     }

[Killed] BooleanLiteral
src/routes/upload.js:73:25
         throw new Error(`Gagal simpan metadata ${jenis}: ${insertError.message}`);
       }
     }
-    res.json({ success: true, message: 'Upload berhasil' });
+    res.json({ success: false, message: 'Upload berhasil' });
   } catch (err) {
     console.error(err);
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "success"

Expected value: true
Received value: false

[Killed] ObjectLiteral
src/routes/upload.js:73:14
         throw new Error(`Gagal simpan metadata ${jenis}: ${insertError.message}`);
       }
     }
-    res.json({ success: true, message: 'Upload berhasil' });
+    res.json({});
   } catch (err) {
     console.error(err);
killedBy: POST /api/upload uploads valid PDF files successfully
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "success"
Received path: []

Expected value: true
Received value: {}

[Killed] BlockStatement
src/routes/upload.js:74:17
       }
     }
     res.json({ success: true, message: 'Upload berhasil' });
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ success: false, error: err.message });
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] BooleanLiteral
src/routes/upload.js:76:37
     res.json({ success: true, message: 'Upload berhasil' });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ success: false, error: err.message });
+    res.status(500).json({ success: true, error: err.message });
   }
 });

[Killed] ObjectLiteral
src/routes/upload.js:76:26
     res.json({ success: true, message: 'Upload berhasil' });
   } catch (err) {
     console.error(err);
-    res.status(500).json({ success: false, error: err.message });
+    res.status(500).json({});
   }
 });
killedBy: POST /api/upload handles storage upload failure
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "error"
Received path: []

Received value: {}
